#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azurerm_resource_group.rg: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03ZWM4YjkyZi02NzEyLTRkZDUtOTBiYy1iNmY2NGNjY2ZjMGU7b2JqZWN0SWQ9ZDA1ODQyNGEtYjdjOC00Y2JmLTljYzktNmUwODkxNzAzNTdjO3N1YnNjcmlwdGlvbklkPTc3MzQ4ZTZjLTAyODYtNDk2Zi04MzM2LTI4ZTk2NmIxMzY0ODt0ZW5hbnRJZD1lNjBiYjc2Yy04ZmRhLTRlZDQtYTM1NC00ODM2ZTNiZmNiYzM=]
data.azurerm_resource_group.rg: Read complete after 0s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae]
data.azurerm_container_registry.acr: Reading...
data.azurerm_app_configuration.appconfig: Reading...
data.azurerm_container_app_environment.env: Reading...
data.azurerm_application_insights.ai: Reading...
data.azurerm_user_assigned_identity.msi: Reading...
data.azurerm_application_insights.ai: Read complete after 1s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Insights/components/ai-biotrackr-prod-ae]
data.azurerm_user_assigned_identity.msi: Read complete after 1s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae]
data.azurerm_container_app_environment.env: Read complete after 2s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae]
data.azurerm_container_registry.acr: Read complete after 2s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ContainerRegistry/registries/acrbiotrackrprodae]
data.azurerm_app_configuration.appconfig: Read complete after 3s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.AppConfiguration/configurationStores/appconfig-biotrackr-prod-ae]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_app.app will be created
  + resource "azurerm_container_app" "app" {
      + container_app_environment_id  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "biotrackr-activityapi-svc"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-biotrackr-prod-ae"
      + revision_mode                 = "Single"
      + tags                          = {
          + "Application" = "biotrackr"
          + "Component"   = "ActivityApi"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }

      + dapr {
          + app_id       = "biotrackr-activityapi-svc"
          + app_protocol = "http"
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 8081
          + transport                  = "auto"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + identity = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae"
          + server   = "acrbiotrackrprodae.azurecr.io"
        }

      + template {
          + max_replicas    = 1
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "acrbiotrackrprodae.azurecr.io/biotrackr-activityapi-svc:6092b1022d5c23d894d27f8d4872a7350c711260"
              + memory            = "0.5Gi"
              + name              = "biotrackr-activityapi-svc"

              + env {
                  + name  = "managedidentityclientid"
                  + value = "e0077542-1278-4f86-95e5-836782e55be2"
                }
              + env {
                  + name  = "azureappconfigendpoint"
                  + value = "https://appconfig-biotrackr-prod-ae.azconfig.io"
                }
              + env {
                  + name  = "appinsightsconnectionstring"
                  + value = (sensitive value)
                }

              + liveness_probe {
                  + failure_count_threshold          = 3
                  + initial_delay                    = 15
                  + interval_seconds                 = 30
                  + path                             = "/healthz/liveness"
                  + port                             = 8081
                  + termination_grace_period_seconds = (known after apply)
                  + timeout                          = 1
                  + transport                        = "HTTPS"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @willvelida, Action: `pull_request`*